Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0323] Another implementation may be that before receiving the rejection message, the terminal stores a security context before update, and the security context before update includes the access stratum key before the update, for example, KgNB.
de_de: [0323] Eine weitere Implementierung kann darin bestehen, dass das Endgerät vor dem Empfangen der Ablehnungsnachricht einen Sicherheitskontext vor der Aktualisierung speichert und der Sicherheitskontext vor der Aktualisierung den Zugriffsschichtschlüssel vor der Aktualisierung enthält, zum Beispiel KgNB.

source: After receiving the rejection message, the terminal uses the security context before update as a current or stored security context.
de_de: Nach dem Empfangen der Ablehnungsnachricht verwendet das Endgerät den Sicherheitskontext vor der Aktualisierung als einen aktuellen oder gespeicherten Sicherheitskontext.

source: Optionally, after receiving the rejection message, the terminal may further delete an updated security context.
de_de: Optional kann das Endgerät nach dem Empfangen der Ablehnungsnachricht ferner einen aktualisierten Sicherheitskontext löschen.

source: Specifically, the security context may be an AS security context of the terminal.
de_de: Insbesondere kann der Sicherheitskontext ein AS-Sicherheitskontext des Endgeräts sein.

source: [0324] After resuming the access stratum key of the terminal to the access stratum key before the update, the terminal keeps the access stratum key before the update, and when resuming a connection next time, the terminal re-performs the manner 2 in step 701 to generate the message authentication code.
de_de: [0324] Nach dem Wiederaufnehmen des Zugriffsschichtschlüssels des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung behält das Endgerät den Zugriffsschichtschlüssel vor der Aktualisierung bei, und wenn das Endgerät eine Verbindung beim nächsten Mal wieder aufnimmt, führt es die Weise 2 in Schritt 701 erneut aus, um den Nachrichtenauthentifizierungscode zu erzeugen.

source: [0325] Because in the scenario in which the target base station rejects the connection resume request of the terminal, the terminal already updates the access stratum key, to maintain key consistency between the terminal and the source base station, the terminal may alternatively roll back the key to resume the access stratum key of the terminal to the access stratum key before the update.
de_de: [0325] Da in dem Szenario, in dem die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, das Endgerät bereits den Zugriffsschichtschlüssel aktualisiert, um die Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechtzuerhalten, kann das Endgerät alternativ den Schlüssel zurückrollen, um den Zugriffsschichtschlüssel des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung wieder aufzunehmen.

source: [0326] Step 706: The target base station sends a context request message to the source base station, and the source base station receives the context request message from the target base station.
de_de: [0326] Schritt 706: Die Zielbasisstation sendet eine Kontextanforderungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Kontextanforderungsnachricht von der Zielbasisstation.

source: [0327] The context request message includes the message authentication code generated by the terminal and the resume identifier, and the context request message is used to request to obtain the context of the terminal.
de_de: [0327] Die Kontextanforderungsnachricht enthält den durch das Endgerät erzeugten Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung, und die Kontextanforderungsnachricht wird verwendet, um anzufordern, den Kontext des Endgeräts zu erhalten.

source: [0328] This step is the same as step 305.
de_de: [0328] Dieser Schritt ist der gleiche wie Schritt 305.

source: [0329] Step 707: The source base station obtains the context of the terminal if checking the message authentication code to be successful.
de_de: [0329] Schritt 707: Die Quellbasisstation erhält den Kontext des Endgeräts, wenn überprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0330] For a specific manner of checking the message authentication code by the source base station, refer to the manner of checking the message authentication code used by the source base station when the terminal generates the message authentication code in the manner 2 in step 306.
de_de: [0330] Für eine spezifische Art der Überprüfung des Nachrichtenauthentifizierungscodes durch die Quellbasisstation, sei auf die Art der Überprüfung des Nachrichtenauthentifizierungscodes, der von der Quellbasisstation verwendet wird, wenn das Endgerät den Nachrichtenauthentifizierungscode in der Art 2 in Schritt 306 erzeugt, hingewiesen.

source: [0331] Step 708: The source base station sends a context response message to the target base station if checking the message authentication code to be successful.
de_de: [0331] Schritt 708: Die Quellbasisstation sendet eine Kontextantwortnachricht an die Zielbasisstation, wenn die Überprüfung des Nachrichtenauthentifizierungscodes erfolgreich ist.

source: [0332] The context response message may include the context of the terminal, for example, include the integrity protection algorithm of the source base station and the integrity protection key of the source base station.
de_de: [0332] Die Kontextantwortnachricht kann den Kontext des Endgeräts enthalten, zum Beispiel den Integritätsschutzalgorithmus der Quellbasisstation und den Integritätsschutzschlüssel der Quellbasisstation enthalten.

source: [0333] Step 709: The target base station sends a connection resume response message to the terminal, and the terminal receives the connection resume response message from the target base station.
de_de: [0333] Schritt 709: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeantwortnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation.

source: [0334] The connection resume response message is used to instruct the terminal to resume an RRC connection.
de_de: [0334] Die Verbindungswiederaufnahmeantwortnachricht wird verwendet, um das Endgerät anzuweisen, eine RRC-Verbindung fortzusetzen.

source: [0335] After step 709, a subsequent procedure of entering the connected state by the terminal from the inactive state is further included.
de_de: [0335] Nach Schritt 709 ist ferner eine nachfolgende Prozedur des Eintretens in den verbundenen Zustand durch das Endgerät aus dem inaktiven Zustand enthalten.

source: [0336] The connection resume request method shown in step 701 to step 709 can effectively resolve a problem existing when the message authentication code is generated in the manner 2 in step 301.
de_de: [0336] Das Verbindungswiederaufnahmeanforderungsverfahren, das in Schritt 701 bis Schritt 709 gezeigt ist, kann effektiv ein Problem lösen, das existiert, wenn der Nachrichtenauthentifizierungscode in der Weise 2 in Schritt 301 erzeugt wird.

source: In the solution shown in FIG. 7, when the target base station determines to reject the connection resume request of the terminal, the target base station further sends the connection resume rejection message to the terminal in step 704, and the terminal resumes the access stratum key of the terminal to the access stratum key before the update in step 705.
de_de: In der Lösung, die in FIG. 7 gezeigt ist, wenn die Zielbasisstation bestimmt, die Verbindungswiederaufnahmeanforderung des Endgeräts abzulehnen, sendet die Zielbasisstation ferner die Verbindungswiederaufnahmeablehnungsnachricht an das Endgerät in Schritt 704, und das Endgerät setzt den Zugriffsschichtschlüssel des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung in Schritt 705 fort.

source: [0337] It should be noted that the connection resume request message, the connection resume response message, the connection resume complete message, the context request message, the context response message, or the like in the foregoing embodiments is merely a name, and the name does not constitute a limitation on the message.
de_de: [0337] Es ist anzumerken, dass die Verbindungswiederaufnahmeanforderungsnachricht, die Verbindungswiederaufnahmeantwortnachricht, die Verbindungswiederaufnahmeabschlussnachricht, die Kontextanforderungsnachricht, die Kontextantwortnachricht oder dergleichen in den vorstehenden Ausführungsformen lediglich ein Name ist und der Name keine Einschränkung der Nachricht darstellt.

source: In a 5G network and another future network, the connection resume request message, the connection resume response message, the connection resume complete message, the context request message, or the context response message may have another name.
de_de: In einem 5G-Netzwerk und einem anderen zukünftigen Netzwerk können die Verbindungswiederaufnahmeanforderungsnachricht, die Verbindungswiederaufnahmeantwortnachricht, die Verbindungswiederaufnahmeabschlussnachricht, die Kontextanforderungsnachricht oder die Kontextantwortnachricht einen anderen Namen haben.

source: This is not specifically limited in the embodiments of this application.
de_de: Dies ist in den Ausführungsformen dieser Anmeldung nicht speziell beschränkt.

source: For example, the connection resume request message may further be replaced with a request message, a resume request message, a connection request message, or the like, the connection resume response message may further be replaced with a response message, a resume response message, a connection response message, or the like, the connection resume complete message may further be replaced with a complete message, a resume complete message, a connection complete message, or the like, the context request message may further be replaced with a request message or the like, and the context response message may further be replaced with a response message or the like.
de_de: Zum Beispiel kann die Verbindungswiederaufnahmeanforderungsnachricht ferner durch eine Anforderungsnachricht, eine Fortsetzungsanforderungsnachricht, eine Verbindungsanforderungsnachricht oder dergleichen ersetzt werden, die Verbindungsfortsetzungsantwortnachricht kann ferner durch eine Antwortnachricht, eine Fortsetzungsantwortnachricht, eine Verbindungsantwortnachricht oder dergleichen ersetzt werden, die Verbindungsfortsetzungsabschlussnachricht kann ferner durch eine Abschlussnachricht, eine Fortsetzungsabschlussnachricht, eine Verbindungsabschlussnachricht oder dergleichen ersetzt werden, die Kontextanforderungsnachricht kann ferner durch eine Anforderungsnachricht oder dergleichen ersetzt werden und die Kontextantwortnachricht kann ferner durch eine Antwortnachricht oder dergleichen ersetzt werden.

source: [0338] The solutions provided in this application are described above mainly from a perspective of interaction between network elements.
de_de: [0338] Die in dieser Anmeldung bereitgestellten Lösungen sind vorstehend hauptsächlich aus einer Perspektive der Interaktion zwischen Netzwerkelementen beschrieben.

source: It may be understood that the network elements include corresponding hardware structures and/or software modules for performing the foregoing functions.
de_de: Es versteht sich, dass die Netzwerkelemente entsprechende Hardwarestrukturen und/oder Softwaremodule zum Ausführen der vorstehenden Funktionen beinhalten.

source: A person of ordinary skill in the art should easily be aware that, in combination with the examples described in the embodiments disclosed in this specification, units and algorithms steps may be implemented by hardware or a combination of hardware and computer software.
de_de: Ein Durchschnittsfachmann sollte sich leicht darüber im Klaren sein, dass in Kombination mit den Beispielen, die in den in dieser Spezifikation offenbarten Ausführungsformen beschrieben sind, Einheiten und Algorithmenschritte durch Hardware oder eine Kombination aus Hardware und Computersoftware implementiert werden können.

source: Whether a function is performed by hardware or hardware driven by computer software depends on particular applications and design constraints of the technical solutions.
de_de: Ob eine Funktion durch Hardware oder durch Computersoftware gesteuerte Hardware ausgeführt wird, hängt von bestimmten Anwendungen und Gestaltungseinschränkungen der technischen Lösungen ab.

source: A person skilled in the art may use different methods to implement the described functions for each particular application, but it should not be considered that the implementation goes beyond the scope of the present invention.
de_de: Ein Fachmann kann verschiedene Verfahren verwenden, um die beschriebenen Funktionen für jede bestimmte Anwendung zu implementieren, es sollte jedoch nicht berücksichtigt werden, dass die Implementierung über den Umfang der vorliegenden Erfindung hinausgeht.

source: [0339] Based on a same inventive concept, FIG. 8 is a schematic diagram of an apparatus according to this application.
de_de: [0339] Basierend auf demselben erfinderischen Konzept ist FIG. 8 ein schematisches Diagramm einer Vorrichtung gemäß dieser Anmeldung.

source: The apparatus may be a terminal, a target base station, or a source base station, and may perform the method performed by the terminal, the target base station, or the source base station in any one of the foregoing embodiments.
de_de: Die Vorrichtung kann ein Endgerät, eine Zielbasisstation oder eine Quellbasisstation sein und kann das Verfahren durchführen, das von dem Endgerät, der Zielbasisstation oder der Quellbasisstation in einer beliebigen der vorstehenden Ausführungsformen durchgeführt wird.

source: [0340] The apparatus 800 includes at least one processor 801, a transmitter 802, and a receiver 803, and optionally, further includes a memory 804.
de_de: [0340] Die Vorrichtung 800 beinhaltet mindestens einen Prozessor 801, einen Sender 802 und einen Empfänger 803 und beinhaltet optional ferner einen Speicher 804.

source: The processor 801, the transmitter 802, the receiver 803, and the memory 804 are connected by using a communications line.
de_de: Der Prozessor 801, der Sender 802, der Empfänger 803 und der Speicher 804 sind unter Verwendung einer Kommunikationsleitung verbunden.

source: [0341] The processor 801 may be a general central processing unit (CPU), a microprocessor, an application-specific integrated circuit (application-specific integrated circuit, ASIC), or one or more integrated circuits configured to control execution of a program in the solutions of the present invention.
de_de: [0341] Der Prozessor 801 kann eine allgemeine zentrale Verarbeitungseinheit (CPU), ein Mikroprozessor, eine anwendungsspezifische integrierte Schaltung (anwendungsspezifische integrierte Schaltung, ASIC) oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Ausführung eines Programms in den Lösungen der vorliegenden Erfindung zu steuern.

source: [0342] The communications line may include a path for transmitting information between the foregoing units.
de_de: [0342] Die Kommunikationsleitung kann einen Pfad zum Übertragen von Informationen zwischen den vorstehenden Einheiten beinhalten.

source: [0343] The transmitter 802 and the receiver 803 are configured to communicate with another device or a communications network.
de_de: [0343] Der Sender 802 und der Empfänger 803 sind konfiguriert, um mit einer anderen Vorrichtung oder einem Kommunikationsnetzwerk zu kommunizieren.

source: The transmitter and the receiver include a radio frequency circuit.
de_de: Der Sender und der Empfänger beinhalten eine Funkfrequenzschaltung.

source: [0344] The memory 804 may be a read-only memory (read-only memory, ROM) or another type of static storage device that can store static information and an instruction, a random access memory (random access memory, RAM) or another type of dynamic storage device that can store information and an instruction, or may be an electrically erasable programmable read-only memory (electrically erasable programmable read-only memory, EEPROM), a compact disc read-only memory (compact disc read-only memory, CD-ROM) or another compact disc storage, an optical disc storage (including a compressed optical disc, a laser disc, an optical disc, a digital versatile disc, a Blu-ray optical disc, and the like), a magnetic disk storage medium or another magnetic storage device, or any other medium that can be configured to carry or store expected program code in a form of an instruction or a data structure and that can be accessed by a computer, but is not limited thereto.
de_de: [0344] Der Speicher 804 kann ein Nur-Lese-Speicher (Nur-Lese-Speicher, ROM) oder eine andere Art von statischer Speichervorrichtung sein, die statische Informationen und eine Anweisung speichern kann, ein Direktzugriffsspeicher (Direktzugriffsspeicher, RAM) oder eine andere Art von dynamischer Speichervorrichtung, die Informationen und eine Anweisung speichern kann, oder kann ein elektrisch löschbarer programmierbarer Nur-Lese-Speicher (elektrisch löschbarer programmierbarer Nur-Lese-Speicher, EEPROM), ein Compact-Disc-Nur-Lese-Speicher (Compact-Disc-Nur-Lese-Speicher, CD-ROM) oder ein anderer Compact-Disc-Speicher, ein optischer Plattenspeicher (einschließlich einer komprimierten optischen Platte, einer Laserplatte, einer optischen Platte, einer Digital Versatile Disc, einer optischen Blu-Ray-Disc und dergleichen), ein Magnetplattenspeichermedium oder eine andere magnetische Speichervorrichtung oder ein beliebiges anderes Medium sein, das konfiguriert sein kann, um erwarteten Programmcode in Form einer Anweisung oder einer Datenstruktur zu tragen oder zu speichern, und auf das durch einen Computer zugegriffen werden kann, ist aber nicht darauf beschränkt.

source: The memory 804 may exist independently, and be connected to the processor 801 by using the communications line.
de_de: Der Speicher 804 kann unabhängig existieren und unter Verwendung der Kommunikationsleitung mit dem Prozessor 801 verbunden sein.

source: Alternatively, the memory 804 may be integrated with the processor.
de_de: Alternativ kann der Speicher 804 in den Prozessor integriert sein.

source: The memory 804 is configured to store application program code for performing the solutions in the present invention, where the application program code is executed under control of the processor 801.
de_de: Der Speicher 804 ist konfiguriert, um Anwendungsprogrammcode zum Durchführen der Lösungen in der vorliegenden Erfindung zu speichern, wobei der Anwendungsprogrammcode unter der Steuerung des Prozessors 801 ausgeführt wird.

source: The processor 801 is configured to execute the application program code stored in the memory 804.
de_de: Der Prozessor 801 ist dazu konfiguriert, den in dem Speicher 804 gespeicherten Anwendungsprogrammcode auszuführen.

source: [0345] During specific implementation, in an embodiment, the processor 801 may include one or more CPUs, for example, a CPU 0 and a CPU 1 in FIG. 8.
de_de: [0345] Bei einer konkreten Implementierung kann der Prozessor 801 in einer Ausführungsform eine oder mehrere CPUs beinhalten, beispielsweise eine CPU 0 und eine CPU 1 in Fig. 8.

source: [0346] During specific implementation, in an embodiment, the apparatus 800 may include a plurality of processors, for example, the processor 801 and a processor 808 in FIG. 8. Each of the processors may be a single-core (single-CPU) processor, or may be a multi-core (multi-CPU) processor.
de_de: [0346] Bei einer konkreten Implementierung kann die Vorrichtung 800 in einer Ausführungsform mehrere Prozessoren beinhalten, beispielsweise den Prozessor 801 und einen Prozessor 808 in Fig. 8. Jeder der Prozessoren kann ein Einzelkernprozessor (Einzel-CPU) oder ein Mehrkernprozessor (Mehrfach-CPU) sein.

source: Herein, the processor may be one or more devices, circuits, and/or processing cores for processing data (for example, a computer instruction).
de_de: Hierbei kann der Prozessor eine oder mehrere Vorrichtungen, Schaltungen und/oder Verarbeitungskerne zum Verarbeiten von Daten (beispielsweise einer Computeranweisung) sein.

source: [0347] It should be understood that when the apparatus 800 is a terminal, the apparatus 800 may be configured to implement steps performed by the terminal in the methods in the embodiments of the present invention.
de_de: [0347] Es versteht sich, dass für den Fall, dass es sich bei der Vorrichtung 800 um ein Endgerät handelt, die Vorrichtung 800 kofiguriert sein kann, die von dem Endgerät in den Verfahren der Ausführungsformen der vorliegenden Erfindung durchgeführten Schritte auszuführen.

source: For example, the apparatus 800 may perform step 301, step 302, step 304, and step 308 in FIG. 3, may further perform step 401, step 402, step 407, and step 411 in FIG. 4, may further perform step 501, step 502, step 507, and step 511 in FIG. 5, may further perform step 601, step 602, step 607, and step 611 in FIG. 6, and may further perform step 701, step 702, step 704, and step 709 in FIG. 7. For related features, refer to the foregoing description.
de_de: Beispielsweise kann die Vorrichtung 800 Schritt 301, Schritt 302, Schritt 304 und Schritt 308 in Fig. 3 durchführen, ferner Schritt 401, Schritt 402, Schritt 407 und Schritt 411 in Fig. 4 durchführen, ferner Schritt 501, Schritt 502, Schritt 507 und Schritt 511 in Fig. 5 durchführen, ferner Schritt 601, Schritt 602, Schritt 607 und Schritt 611 in Fig. 6 durchführen und ferner Schritt 701, Schritt 702, Schritt 704 und Schritt 709 in Fig. 7 durchführen. Hinsichtlich der zugehörigen Merkmale sei auf die vorstehende Beschreibung verwiesen.

source: [0348] When the apparatus 800 is a target base station, the apparatus 800 may be configured to implement steps performed by the target base station in the methods in the embodiments of the present invention.
de_de: [0348] Sofern es sich bei der Vorrichtung 800 um eine Zielbasisstation handelt, kann die Vorrichtung 800 konfiguriert sein, die von der Zielbasisstation in den Verfahren der Ausführungsformen der vorliegenden Erfindung durchgeführten Schritte auszuführen.

source: For example, the apparatus 800 may perform step 302, step 303, step 304, step 305, step 307, and step 308 in FIG. 3, may further perform step 402, step 403, step 404, step 406, step 407, step 408, step 410, and step 411 in FIG. 4, may further perform step 502, step 503, step 504, step 506, step 507, step 508, step 510, and step 511 in FIG. 5, may further perform step 602, step 603, step 604, step 606, step 607, step 608, step 610, and step 611 in FIG. 6, and may further perform step 702, step 703, step 704, step 706, step 708, and step 709 in FIG. 7. For related features, refer to the foregoing description.
de_de: Beispielsweise kann die Vorrichtung 800 Schritt 302, Schritt 303, Schritt 304, Schritt 305, Schritt 307 und Schritt 308 in FIG. 3 durchführen, ferner Schritt 402, Schritt 403, Schritt 404, Schritt 406, Schritt 407, Schritt 408, Schritt 410 und Schritt 411 in FIG. 4 durchführen, ferner Schritt 502, Schritt 503, Schritt 504, Schritt 506, Schritt 507, Schritt 508, Schritt 510 und Schritt 511 in FIG. 5 durchführen, ferner Schritt 602, Schritt 603, Schritt 604, Schritt 606, Schritt 607, Schritt 608, Schritt 610 und Schritt 611 in FIG. 6 durchführen und ferner Schritt 702, Schritt 703, Schritt 704, Schritt 706, Schritt 708 und Schritt 709 in FIG. 7 durchführen. Hinsichtlich der zugehörigen Merkmale sei auf die vorstehende Beschreibung verwiesen.
